app/views/books/index.html.erb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT 1  [["id", 2]]
---
<p><%= link_to book_path(id: book.id), class:"Title" do %><%= book.title %><% end %> </p>
<p>By<%= book.author.first_name %> <%= book.author.last_name %> </p>