app/views/books/new.html.erb

    <%= f.label :author %>
    <%= f.collection_select :author_id, Author.all, :id, :full_name, {prompt: true},  {class: "form-control"} %>
---
SELECT "authors".* FROM "authors"  ORDER BY name asc