app/controllers/books_controller.rb

SELECT "books".* FROM "books"  ORDER BY title asc
---
  def index
    @books=Book.all.order("title asc")

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
---
  def view
    @book = Book.find_by id: params[:id]

INSERT INTO "books" ("title", "author_id", "photo_id", "price") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "TLOZ"], ["author_id", 1], ["photo_id", "http://files.mom.me/photos/2015/05/15/122-103215-view-siamese-cat-2-1431706963.jpg"], ["price", "$33"]]
---
  def create
    # instantiate a blank Book object
    @book = Book.new
    # set the values
    @book.title = params[:book][:title]
    @book.author_id = params[:book][:author_id]
    @book.photo_id = params[:book][:photo_id]
    @book.price = params[:book][:price]
    # save it
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @book = Book.find_by id: params[:id]

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "books" SET "photo_id" = $1 WHERE "books"."id" = $2
---
  def update
      # instantiant / Find
      @book = Book.find_by id: params[:id]
      # set values
      @book.title = params[:book][:title]
      @book.author_id = params[:book][:author_id]
      @book.photo_id = params[:book][:photo_id]
      @book.price = params[:book][:price]
      # save it
      if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 4]]
---
    def delete
      # get the record
      @book = Book.find_by id: params[:id]
      # destroy the record
      @book.destroy